backend/controllers/BuyerRequestController.php

INSERT INTO `brands` (`title`, `created_at`, `updated_at`) VALUES ('test2', 1603719409, 1603719409)
---
    public function actionCreate()
    {
        $model = new BuyerRequest();

        if ($model->load(Yii::$app->request->post()) ) {

            $model->user_id = Yii::$app->user->identity->id;

            if ($model->brand_id == 11) {
                $brandModel = new Brand();
                $brandModel->title = $model->other_brand;
                if($brandModel->save()){

INSERT INTO `brands` (`title`, `created_at`, `updated_at`) VALUES ('test', 1603719335, 1603719335)
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post())) {

            if ($model->brand_id == 11) {
                $brandModel = new Brand();
                $brandModel->title = $model->other_brand;
                if($brandModel->save()){

SELECT * FROM `buyer_requests` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = BuyerRequest::findOne($id)) !== null) {