backend/controllers/CategoryController.php

SELECT * FROM `categories` WHERE `parent_id`='1'
---
    public function actionSubcategory($id) {

        $categories = Category::find()->where(['parent_id' => $id])->all();

SELECT * FROM `categories` WHERE `parent_id`='8'
---
    public function actionSub2category($id) {
        $categories = Category::find()->where(['parent_id' => $id])->all();