backend/views/buyer-request/_form.php

    <div class="row">
        <div class="col-md-4">
            <?php
                $parent_cat = Category::find()->where(['parent_id' => 0])->all();
---
SELECT * FROM `categories` WHERE `parent_id`=0

                $sub_cat_list = [];
                $sub_cat_2_list = [];
                if(!$model->isNewRecord){
                    $sub_category = Category::find()->where(['parent_id' => $model->main_cat_id])->all();
                    $sub_cat_list = ArrayHelper::map($sub_category, 'id', 'title');

                    $sub_category_2 = Category::find()->where(['parent_id' => $model->sub_cat_id])->all();
                    $sub_cat_2_list = ArrayHelper::map($sub_category_2, 'id', 'title');
                }

                $brands = Brand::find()->all();
                $brandList = ArrayHelper::map($brands, 'id', 'title');
                $fabrics = Fabric::find()->all();
                $fabricList = ArrayHelper::map($fabrics, 'id', 'name');
                $measurements = Measurement::find()->all();
                $measurementList = ArrayHelper::map($measurements, 'id', 'name');
                $qualities = Quality::find()->all();
                $qualityList = ArrayHelper::map($qualities, 'id', 'name');
                $colors = Color::find()->all();
---
SELECT * FROM `categories` WHERE `parent_id`=1
SELECT * FROM `categories` WHERE `parent_id`=2
SELECT * FROM `brands`
SELECT * FROM `fabrics`
SELECT * FROM `measurements`
SELECT * FROM `qualities`
SELECT * FROM `colors`