common/models/User.php

SELECT * FROM `user` WHERE `access_token`='xc3HY95fBFtCPzCc_aVEtDyzkJpdO_8rDF6DCEyNfXaAf6aM_b'
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['access_token' => $token]);