backend/modules/api/controllers/AttributeController.php

SELECT * FROM `brands`
SELECT * FROM `colors`
SELECT * FROM `measurements`
SELECT * FROM `qualities`
---
    public function actionGetAllAttribute(){
      Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;

      $data = [];

      $brands = [];
      $brandsModel = Brand::find()->all();
      foreach ($brandsModel as $key => $brand) {
        $brands[$brand->id] = $brand->title;
      }

      $data['brands'] = $brands;

      $colors = [];
      $colorsModel = Color::find()->all();
      foreach ($colorsModel as $key => $color) {
        $colors[$color->id] = $color->name;
      }

      $data['colors'] = $colors;

      $measurements = [];
      $measurementsModel = Measurement::find()->all();
      foreach ($measurementsModel as $key => $measurement) {
        $measurements[$measurement->id] = $measurement->name;
      }

      $data['measurements'] = $measurements;

      $qualities = [];
      $qualitiesModel = Quality::find()->all();

SELECT * FROM `fabrics`
---
      $data['qualities'] = $qualities;

      $fabrics = [];
      $fabricsModel = Fabric::find()->all();