backend/modules/api/controllers/StockController.php

    public function actionGetAllStock($category){
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;

        // return ['status' => true];
        // die();
        if($category == 0) $models = Stock::find()->all();
        else $models = Stock::find()->where(['sub_cat_2_id' => $category])->all();

        $data = [];
        if($models){
            foreach ($models as $key => $model) {
                $user = User::find()->where(['id' => $model->user_id])->one();
---
SELECT * FROM `stocks` WHERE `sub_cat_2_id`='3'
SELECT * FROM `user` WHERE `id`=1