backend/views/stock/_form.php

SELECT * FROM `categories` WHERE `parent_id`=0
---
<div class="stock-form">

    <?php
        $parent_cat = Category::find()->where(['parent_id' => 0])->all();

SELECT * FROM `brands`
SELECT * FROM `fabrics`
SELECT * FROM `measurements`
SELECT * FROM `qualities`
SELECT * FROM `colors`
---
            $sub_cat_2_list = ArrayHelper::map($sub_category_2, 'id', 'title');
        }

        $brands = Brand::find()->all();
        $brandList = ArrayHelper::map($brands, 'id', 'title');
        $fabrics = Fabric::find()->all();
        $fabricList = ArrayHelper::map($fabrics, 'id', 'name');
        $measurements = Measurement::find()->all();
        $measurementList = ArrayHelper::map($measurements, 'id', 'name');
        $qualities = Quality::find()->all();
        $qualityList = ArrayHelper::map($qualities, 'id', 'name');
        $colors = Color::find()->all();