backend/modules/api/models/Login.php

    public function login()
    {
        if ($this->validate()) {
            //return Yii::$app->user->login($this->getUser(), $this->rememberMe ? 3600*24*30 : 0);
            if($this->getUser()){
                $access_token = $this->_user->generateAccessToken();
                //$this->_user->expire_at = time() + static::EXPIRE_TIME;
                $this->_user->save();
---
UPDATE `user` SET `access_token`='xc3HY95fBFtCPzCc_aVEtDyzkJpdO_8rDF6DCEyNfXaAf6aM_b', `updated_at`=1603735109 WHERE `id`=1