backend/views/category/_form.php

SELECT * FROM `categories` ORDER BY `parent_id`
---
        </div>
        <div class="col-md-4">
            <?php
                $categories = Category::find()->orderBy(['parent_id' => SORT_ASC])->all();